Autodesk.Revit.DB.Architecture.StairsRunJustification
The position of the run relative to the Up-direction path used to create the run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunJustification.RightExterior
The creation path for the run is the right stringer exterior edge.

Autodesk.Revit.DB.Architecture.StairsRunJustification.LeftExterior
The creation path for the run is the left stringer exterior edge.

Autodesk.Revit.DB.Architecture.StairsRunJustification.Right
The creation path for the run is the right edge.

Autodesk.Revit.DB.Architecture.StairsRunJustification.Center
The creation path for the run is the center.

Autodesk.Revit.DB.Architecture.StairsRunJustification.Left
The creation path for the run is the left edge.